[
    {
        "name": "Chicken Biriyani",
        "position": "Kerala Chicken Biriyani",
        "description":"
Ingredients

    Chicken – 900 gm

For Marination:

    Pepper powder – ½ tsp
    Chilly powder – 1 tsp
    Coriander powder – 1½ tsp
    Turmeric powder – ¼ tsp
    Lemon juice – 1 tbsp
    Salt

For Masala

    Onion – 4-5 medium size, finely sliced
    Ginger & Garlic paste – 1½ tbsp each
    Green chilly – 5
    Tomato – 2
    Coriander leaves – a handful
    Yogurt – 2-3 tbsp
    Garam Masala – 1 tsp
    Water – ½ cup
    Cashew nuts – 2tbsp
    Oil/Ghee
    Salt

For Rice

    Basmati rice – 3 cups
    Water – 5 cups (refer notes)
    Cardamom – 4
    Cloves – 4
    Cinnamon – 2 small pieces
    Lemon juice – 2 tbsp
    Coriander leaves – a handful
    Ghee – 2-3 tbsp
    Salt

For garnishing:

    Cashews & raisins – 1 handful each
    Onion – 1 big sliced finely
    Coriander leaves
    Ghee/Oil

Instructions

    Masala Preparation
    Clean the chicken pieces and make small gashes. Marinate the cleaned chicken pieces with the marination ingredients. Keep aside for half an hour and shallow fry the chicken pieces in oil/ghee till it turns golden brown & half cooked.Keep the chicken pieces aside.
    Grind tomato & coriander leaves to a smooth paste. Soak the cashew nuts in hot water (2 tbsp) for 5-10 mins and grind it to a smooth paste. Add the finely sliced onion to the same oil/ghee (in which chicken is fried) and saute till it becomes brown. Add ginger garlic paste and crushed green chilly. Cook for 1-2 minutes. Add the tomato coriander paste and cook till the oil separates. Add garam masala and cook for a minute. Add yogurt, salt and mix well. Add the fried chicken pieces and combine well. Make sure that the chicken pieces are coated well with the masala. Add ½ cup water and cover and cook the chicken. When the chicken is almost done, add the cashew paste. Cook till the chicken is done.
    Rice Preparation
    Wash and soak the rice in water for 25 minutes. Drain the water completely. Boil 5 cups water with half the quantity of whole masala & keep it aside. Heat ghee in a vessel/pan, splutter the remaining whole masala and add the rice. Fry the rice until it starts cracking. Add the boiled water, lemon juice, coriander leaves & salt. Cook till the rice is done and water is completely dried. Spread the rice in a tray & keep aside.
    Layering the Biriyani
    Preheat the oven to 180 degree 10 minutes before baking the biriyani. Apply some ghee to a baking dish. Put one layer of masala in the dish. On top of that spread some rice and make another layer. Again spread another layer of masala on top of the rice. Repeat the process until the masala and rice is finished. The top layer should be of rice. You can drizzle ghee & sprinkle coriander leaves in between the layers. Cover the dish with a wet cloth. Bake in the preheated oven for 25-30 minutes.
    Garnishing:
    Heat ghee/oil in a pan and fry the cashews & raisins. Remove them from the pan & in the remaining ghee/oil fry the onions till it becomes golden brown. Drain the excess ghee in a paper towel & keep it aside.
    Garnish the baked biriyani with fried cashew, raisins, onions & coriander leaves. Serve hot with pickle, raita & pappad.

Notes
I used 10 thigh pieces of chicken for the biriyani. Also I’ve used only 5 cups of water for cooking the rice. Usually the water is double the amount of rice. But it varies depending on the type of Basmati rice you are using. If you tend to overcook the rice, I suggest you use 5 cups and not 6 cups of water for 3 cups of rice. If you dont have an oven to bake the biriyani, do the following method. 1. Layer the rice and masala in a greased heavy bottomed vessel/non stick pan & cover it with a tight lid. 2. Heat a thava/dosa kallu, when it is really hot, place the biriyani vessel on top of that. Reduce the heat to the lowest flame & cook for 20-25 mins. Keep the heat at the lowest flame throughout, otherwise it might get burnt. 3. Also place a pan of boiling water on top of the biriyani vessel at the same time. ",
        "thumbnail": "https://raw.githubusercontent.com/ajither/KeralaKitchen/master/KeralaItem/chickenbiriyani.jpg",
        "image": "https://raw.githubusercontent.com/PaulTR/GettingStartedWithAndroid/master/images/exhibits/giraffe.jpg"
    },
    {
        "name": "Beaf Biriyani",
        "position": "Kerala Beaf Biriyani",
        "description": "Hello Bibin",
        "thumbnail": "https://raw.githubusercontent.com/ajither/KeralaKitchen/master/KeralaItem/beafbiriyani.jpg",
        "image": "https://raw.githubusercontent.com/PaulTR/GettingStartedWithAndroid/master/images/exhibits/galah.jpg"
    },
        {
        "name": "Mutton Biriyani",
        "position": "Kerala Style Mutton Biriyani",
        "description": "Hello Bibin",
        "thumbnail": "https://raw.githubusercontent.com/ajither/KeralaKitchen/master/KeralaItem/muttonbiriyani.jpg",
        "image": "https://raw.githubusercontent.com/PaulTR/GettingStartedWithAndroid/master/images/exhibits/galah.jpg"
    },
    {
        "name": "Malabar Biriyani",
        "position": "Malabar Style Biriyani",
        "description": "Hello Bibin",
        "thumbnail": "https://raw.githubusercontent.com/ajither/KeralaKitchen/master/KeralaItem/malabarbiriyani.jpg",
        "image": "https://raw.githubusercontent.com/ajither/andro_merc/master/teammembers/Ajith.jpg"
    },
    {
        "name": "Thalassery Biriyani",
        "position": "Thalassery Style Biriyani",
        "description": "Hello Bibin",
        "thumbnail": "https://raw.githubusercontent.com/ajither/KeralaKitchen/master/KeralaItem/thalasserybiriyani.jpg",
        "image": "https://raw.githubusercontent.com/ajither/andro_merc/master/teammembers/Ajith.jpg"
    }
]
